app/controllers/items_controller.rb

SELECT `items`.* FROM `items`
---
  def index
    @items = Item.all

INSERT INTO `items` (`name`, `price`, `created_at`, `updated_at`) VALUES ('Adidas Hoodie', 5999.0, '2025-03-19 05:49:38.102068', '2025-03-19 05:49:38.102068')
---
  def create
    @item = Item.new(item_params)
    if @item.save

UPDATE `items` SET `items`.`updated_at` = '2025-03-19 06:49:55.397470', `items`.`inventory_count` = 55 WHERE `items`.`id` = 1
---
  def update
    if @item.update(item_params)

DELETE FROM `items` WHERE `items`.`id` = 3
---
  def destroy
    @item.destroy

SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
---
  def get_item
    @item = Item.find(params[:id])